# Joining Data with Pandas

Joining data with pandas is a fundamental operation when working with tabular data in Python. Pandas provides several methods for combining datasets based on common columns or indices.

### Inner Join

An inner join in pandas combines two DataFrames based on a common column (or columns) and returns only the rows where there is a match in both DataFrames. This operation is analogous to the SQL INNER JOIN

In [1]:
import pandas as pd

In [2]:
path = r"C:\Users\Alysson\Documents\GitHub\Pandas-in-Python\database.xlsx"
data_1 = pd.read_excel(path)
data_1.head()

       name          breed  color  height_cm  weight_kg  age
0    Paçoca       Labrador  Brown         56         25    5
1       Ivo         Poodle  Black         43         22    4
2      Lola      Schnauzer   Gray         49         23    4
3  Maracatu  King Cavalier  Brown         43         21    3
4   Chantal       Labrador  Black         59         29    6

In [3]:
path = r"C:\Users\Alysson\Documents\GitHub\Pandas-in-Python\database_2.xlsx"
data_2 = pd.read_excel(path)
data_2.head()

       name     owner injured  age_owner        hometown
0    Paçoca     Pedro     yes         30          Lisbon
1       Ivo     Mario     yes         34  Rio de Janeiro
2      Lola     Maria      no         63        Brasilia
3  Maracatu      Gabi      no         28         Londres
4   Chantal  Fernanda      no         27    Minas Gerais

### Mergins Tables

Merging tables (also known as dataframes) using Pandas is a common operation in data manipulation and analysis. Pandas provides a variety of methods for merging tables based on different criteria.

In [4]:
data_complete = data_1.merge(data_2, on="name")
data_complete

,name,breed,color,height_cm,weight_kg,age,owner,injured,age_owner,hometown
0,Paçoca,Labrador,Brown,56,25,5,Pedro,yes,30,Lisbon
1,Ivo,Poodle,Black,43,22,4,Mario,yes,34,Rio de Janeiro
2,Lola,Schnauzer,Gray,49,23,4,Maria,no,63,Brasilia
3,Maracatu,King Cavalier,Brown,43,21,3,Gabi,no,28,Londres
4,Chantal,Labrador,Black,59,29,6,Fernanda,no,27,Minas Gerais
5,Xuxu,King Cavalier,White,41,20,5,Teco,no,41,Poland
6,Rex,Korg,Brown,40,23,4,Alysson,no,32,Fortaleza

In [5]:
data_complete.shape

(7, 10)

### One-to-many relationships

In [6]:
path = r"C:\Users\Alysson\Documents\GitHub\Pandas-in-Python\database_3.xlsx"
data_3 = pd.read_excel(path)
data = data_1.merge(data_3, on="name")
data

,name,breed,color,height_cm,weight_kg,age,owner,injured,age_owner,hometown
0,Paçoca,Labrador,Brown,56,25,5,Pedro,yes,30,Lisbon
1,Ivo,Poodle,Black,43,22,4,Mario,yes,34,Rio de Janeiro
2,Lola,Schnauzer,Gray,49,23,4,Maria,no,63,Brasilia
3,Lola,Schnauzer,Gray,49,23,4,Raimundo,no,75,Parnaiba
4,Maracatu,King Cavalier,Brown,43,21,3,Gabi,no,28,Londres
5,Chantal,Labrador,Black,59,29,6,Fernanda,no,27,Minas Gerais
6,Chantal,Labrador,Black,59,29,6,Cabral,no,30,São Paulo
7,Xuxu,King Cavalier,White,41,20,5,Teco,no,41,Poland
8,Rex,Korg,Brown,40,23,4,Alysson,no,32,Fortaleza

In [7]:
data.shape

(9, 10)

### Merge with left Join

A left join combines rows from two dataframes based on a common column, including all rows from the left dataframe and matching rows from the right dataframe.

In [8]:
data_left = data_1.merge(data_3, on="name", how = "left")
data_left

,name,breed,color,height_cm,weight_kg,age,owner,injured,age_owner,hometown
0,Paçoca,Labrador,Brown,56,25,5,Pedro,yes,30,Lisbon
1,Ivo,Poodle,Black,43,22,4,Mario,yes,34,Rio de Janeiro
2,Lola,Schnauzer,Gray,49,23,4,Maria,no,63,Brasilia
3,Lola,Schnauzer,Gray,49,23,4,Raimundo,no,75,Parnaiba
4,Maracatu,King Cavalier,Brown,43,21,3,Gabi,no,28,Londres
5,Chantal,Labrador,Black,59,29,6,Fernanda,no,27,Minas Gerais
6,Chantal,Labrador,Black,59,29,6,Cabral,no,30,São Paulo
7,Xuxu,King Cavalier,White,41,20,5,Teco,no,41,Poland
8,Rex,Korg,Brown,40,23,4,Alysson,no,32,Fortaleza

### Merging Multiple DataFrames

Similar to the previous case, but we use a list of columns that we would like to merge.

In [ ]:
list = ["name_col_1, name_col_2"]
data = data_1.merge(data_3, on=list)\
                .merge(data_2, on = "name")

### Other Joins

* An outer join combines rows from both dataframes, including all rows from both dataframes and filling in missing values with NaN where there is no match.

* A right join combines rows from both dataframes, including all rows from the right dataframe and matching rows from the left dataframe.

In [10]:
data_right = data_1.merge(data_3, on="name", how = "right")
data_right

,name,breed,color,height_cm,weight_kg,age,owner,injured,age_owner,hometown
0,Paçoca,Labrador,Brown,56,25,5,Pedro,yes,30,Lisbon
1,Ivo,Poodle,Black,43,22,4,Mario,yes,34,Rio de Janeiro
2,Lola,Schnauzer,Gray,49,23,4,Maria,no,63,Brasilia
3,Maracatu,King Cavalier,Brown,43,21,3,Gabi,no,28,Londres
4,Chantal,Labrador,Black,59,29,6,Fernanda,no,27,Minas Gerais
5,Xuxu,King Cavalier,White,41,20,5,Teco,no,41,Poland
6,Rex,Korg,Brown,40,23,4,Alysson,no,32,Fortaleza
7,Chantal,Labrador,Black,59,29,6,Cabral,no,30,São Paulo
8,Lola,Schnauzer,Gray,49,23,4,Raimundo,no,75,Parnaiba

In [11]:
data_outer = data_1.merge(data_3, on="name", how = "outer")
data_outer

,name,breed,color,height_cm,weight_kg,age,owner,injured,age_owner,hometown
0,Paçoca,Labrador,Brown,56,25,5,Pedro,yes,30,Lisbon
1,Ivo,Poodle,Black,43,22,4,Mario,yes,34,Rio de Janeiro
2,Lola,Schnauzer,Gray,49,23,4,Maria,no,63,Brasilia
3,Lola,Schnauzer,Gray,49,23,4,Raimundo,no,75,Parnaiba
4,Maracatu,King Cavalier,Brown,43,21,3,Gabi,no,28,Londres
5,Chantal,Labrador,Black,59,29,6,Fernanda,no,27,Minas Gerais
6,Chantal,Labrador,Black,59,29,6,Cabral,no,30,São Paulo
7,Xuxu,King Cavalier,White,41,20,5,Teco,no,41,Poland
8,Rex,Korg,Brown,40,23,4,Alysson,no,32,Fortaleza

### Right_on / Left_on

They allow you to specify the columns from the right and left DataFrames that should be used as the keys for the merge, respectively. This is particularly useful when the columns you want to merge on have different names in the two DataFrames.

In [12]:
import pandas as pd

# Creating two example DataFrames
left_data = {'ID_left': [1, 2, 3],
             'Value_left': ['A', 'B', 'C']}
right_data = {'ID_right': [2, 3, 4],
              'Value_right': ['X', 'Y', 'Z']}

left_df = pd.DataFrame(left_data)
right_df = pd.DataFrame(right_data)

# Performing a merge using right_on and left_on
result_df = left_df.merge(right_df, left_on='ID_left', right_on='ID_right', how='inner')

print(result_df)

   ID_left Value_left  ID_right Value_right
0        2          B         2           X
1        3          C         3           Y

### Mergin on indexes

When merging on indexes, you use the left_index and right_index parameters to indicate that you want to use the indexes of the DataFrames as the merge keys. This can be useful when you want to combine DataFrames based on their index labels rather than specific columns.

In [15]:
data1 = {'Value_1': ['A', 'B', 'C']}
data2 = {'Value_2': ['X', 'Y', 'Z']}

index = [1, 2, 3]

df1 = pd.DataFrame(data1, index=index)
df2 = pd.DataFrame(data2, index=index)

# Performing a merge on indexes
result_df = df1.merge(df2, left_index=True, right_index=True)

print(result_df)

  Value_1 Value_2
1       A       X
2       B       Y
3       C       Z